let handler = async (m, { isPrems, conn }) => {

let img = 'https://img.freepik.com/premium-photo/young-adult-woman-with-creative-makeup-glamour_1077802-15091.jpg?semt=ais_hybrid&w=740' 
let texto = `🌟 𝐌𝐄𝐍𝐔 🌟
*˚₊·˚₊· ͟͟͞͞➳❥ @+${m.sender.split("@")[0]}*
> ┆ *│* ┊▸ ✦ 
> ┆ *│* ╰∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙∙ ∙ ∙ ∙ ∙ 
*> ┣━━━━━━━━━━━ ┅*
*> ┃✧✧✧✧✧✧✧✧✧✧✧✧✧✧*
*> ┃*       *Создатель бота*
*> ┃*              *Серега* 
*> ┃*      *По всем вопросам*
*> ┃*     *о боте пишите по номеру*
*> ┃*         *+79615370645*
*> ┃✧✧✧✧✧✧✧✧✧✧✧✧✧✧*
*> ┗━━━━━━━━━━━*  
> ┆ ——————«•»——————
> ┆          ☆::Меню::☆*
> ┆——————«•»——————
> ┆ *Включить приветствие*
> ┆ *Выключить приветствие*
> ┆ *Включить антиссылка*
> ┆ *Выключить антиссылка*
> ┆ *Включить антиссылка2*
> ┆ *Выключить антиссылка2*
> ┆ *Включить аудио*
> ┆ *Выключить аудио*
> ┆ *Включить авточтение*
> ┆ *Выключить авточтение*
> ┆ *Включить антивызов*
> ┆ *Выключить антивызов*
> ┆ *Включить толькоадмин*
> ┆ *Выключить толькоадмин*
> ┆ *Включить антиличка*
> ┆ *Выключить антиличка*
> ┆ *Вызов*
> ┆ **
> ┆ **
> ┆ **
> ┆ **
















──────────────────
⚠️ *Ознакомтесь с правильностью команд*.`
const fkontak = {
        "key": {
    "participants":"0@s.whatsapp.net",
                "remoteJid": "status@broadcast",
                "fromMe": false,
                "id": "Halo"
        },
        "message": {
                "contactMessage": {
                        "vcard": `BEGIN:VCARD\nVERSION:3.0\nN:Sy;Bot;;;\nFN:y\nitem1.TEL;waid=${m.sender.split('@')[0]}:${m.sender.split('@')[0]}\nitem1.X-ABLabel:Ponsel\nEND:VCARD`
                }
        },
        "participant": "0@s.whatsapp.net"
}
await conn.sendFile(m.chat, img, 'img.jpg', texto, fkontak)
}
handler.help = ['menuhot (menu +18)']
handler.tags = ['main']
handler.command = ['меню'] 
export default handler;
